Looks like there's a bug in that redis is being created when it shouldn't for catalog. I'll follow up in a separate PR.

sandbox-plan:

```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.catalog.aws_security_group.web will be created
  + resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "Security group for catalog web instance in sandbox"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "catalog-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "catalog"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.catalog.module.redis.aws_elasticache_cluster.redis will be created
  + resource "aws_elasticache_cluster" "redis" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "catalog-sandbox"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.6"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t3.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = "default.redis5.0"
      + port                   = 6379
      + replication_group_id   = (known after apply)
      + security_group_ids     = (known after apply)
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = "catalog-sandbox"
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "catalog"
        }
    }

  # module.catalog.module.redis.aws_elasticache_subnet_group.redis will be created
  + resource "aws_elasticache_subnet_group" "redis" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "catalog-sandbox"
      + subnet_ids  = [
          + "subnet-0bbe8705ad1ce9a08",
          + "subnet-0f531007fa515a1fb",
        ]
    }

  # module.catalog.module.redis.aws_security_group.redis will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "catalog-redis-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "catalog"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.catalog.module.web.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-086bab6c119611129"
        description            = "Load balancer security group for catalog-sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        id                     = "sg-086bab6c119611129"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "catalog-sandbox-lb-sg-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.catalog_next.module.web.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-014f50072aee1af67"
        description            = "Load balancer security group for catalog-next-sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        id                     = "sg-014f50072aee1af67"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "catalog-next-sandbox-lb-sg-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.dashboard.module.web.aws_instance.web[0] will be updated in-place
  ~ resource "aws_instance" "web" {
        ami                          = "ami-085925f297f89fce1"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-01a8981ee41d9991b"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 1
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
        id                           = "i-01a8981ee41d9991b"
        instance_state               = "running"
        instance_type                = "t2.micro"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-0160b4a03504e1032"
        private_dns                  = "ip-10-0-1-66.ec2.internal"
        private_ip                   = "10.0.1.66"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      ~ tags                         = {
            "Name"  = "dashboard-web1tf"
            "env"   = "sandbox"
          ~ "group" = "dashboard_web" -> "dashboard_web,v2"
        }
        tenancy                      = "default"
        volume_tags                  = {}
        vpc_security_group_ids       = [
            "sg-01465b85df2ea8e05",
            "sg-0599014293c0c3234",
            "sg-06d027616535125d5",
        ]

        credit_specification {
            cpu_credits = "standard"
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-0add9fabb017d3135"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }

  # module.dashboard.module.web.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0ed53248973202902"
        description            = "Load balancer security group for dashboard-sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        id                     = "sg-0ed53248973202902"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "dashboard-sandbox-lb-sg-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory.module.web.aws_instance.web[0] will be updated in-place
  ~ resource "aws_instance" "web" {
        ami                          = "ami-000b3a073fc20e415"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-01f4189152f11f533"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 2
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
      - iam_instance_profile         = "inventory-sandbox-inventory-profile" -> null
        id                           = "i-01f4189152f11f533"
        instance_state               = "running"
        instance_type                = "t3.small"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-0811947fa48d3b8b2"
        private_dns                  = "ip-10-0-1-98.ec2.internal"
        private_ip                   = "10.0.1.98"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
        tags                         = {
            "Name"  = "inventory-web1tf"
            "env"   = "sandbox"
            "group" = "inventory_web"
        }
        tenancy                      = "default"
        volume_tags                  = {}
        vpc_security_group_ids       = [
            "sg-0093fa00d33af5b22",
            "sg-0599014293c0c3234",
            "sg-0cb28298e90b22f14",
            "sg-0e9cccfec020fe66d",
        ]

        credit_specification {
            cpu_credits = "unlimited"
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-0b32b5298a0e9919c"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }

  # module.inventory.module.web.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-09b1e93a6c5c24a0c"
        description            = "Load balancer security group for inventory-sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        id                     = "sg-09b1e93a6c5c24a0c"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "inventory-sandbox-lb-sg-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_2_8.module.web.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0bf6092e3bc48d8ce"
        description            = "Load balancer security group for inventory-2-8-sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        id                     = "sg-0bf6092e3bc48d8ce"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "inventory-2-8-sandbox-lb-sg-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.wordpress.module.web.aws_instance.web[0] will be updated in-place
  ~ resource "aws_instance" "web" {
        ami                          = "ami-085925f297f89fce1"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-02b4cb9a67b48c388"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 1
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
        id                           = "i-02b4cb9a67b48c388"
        instance_state               = "running"
        instance_type                = "t2.micro"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-0e427e7e131fffedd"
        private_dns                  = "ip-10-0-1-38.ec2.internal"
        private_ip                   = "10.0.1.38"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      ~ tags                         = {
            "Name"  = "wordpress-web1tf"
            "env"   = "sandbox"
          ~ "group" = "wordpress_web" -> "wordpress_web,v2"
        }
        tenancy                      = "default"
        volume_tags                  = {}
        vpc_security_group_ids       = [
            "sg-0599014293c0c3234",
            "sg-0669ddcd345e6a2f0",
            "sg-0d3b8a46a0dc7a198",
        ]

        credit_specification {
            cpu_credits = "standard"
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-0c317001f35d545b3"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }

  # module.wordpress.module.web.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0399c117334e1a758"
        description            = "Load balancer security group for wordpress-sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.101.0/24",
                  - "10.0.102.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        id                     = "sg-0399c117334e1a758"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "wordpress-sandbox-lb-sg-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.dashboard.module.db.module.database.aws_db_instance.default will be updated in-place
  ~ resource "aws_db_instance" "default" {
        address                               = "terraform-20200416212304398200000001.clsowbdquocd.us-east-1.rds.amazonaws.com"
      ~ allocated_storage                     = 10 -> 20
        arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200416212304398200000001"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1a"
        backup_retention_period               = 0
        backup_window                         = "09:42-10:12"
        ca_cert_identifier                    = "rds-ca-2019"
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
        deletion_protection                   = false
        enabled_cloudwatch_logs_exports       = []
        endpoint                              = "terraform-20200416212304398200000001.clsowbdquocd.us-east-1.rds.amazonaws.com:3306"
        engine                                = "mysql"
        engine_version                        = "5.7.22"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "terraform-20200416212304398200000001"
        identifier                            = "terraform-20200416212304398200000001"
        instance_class                        = "db.t2.micro"
        iops                                  = 0
        license_model                         = "general-public-license"
        maintenance_window                    = "tue:08:25-tue:08:55"
        max_allocated_storage                 = 0
        monitoring_interval                   = 0
        multi_az                              = false
        name                                  = "dashboard_db"
        option_group_name                     = "default:mysql-5-7"
        parameter_group_name                  = "default.mysql5.7"
        password                              = (sensitive value)
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 3306
        publicly_accessible                   = false
        replicas                              = []
        resource_id                           = "db-4DDVHNV7T7EOICJMU5OWAO5IDA"
        security_group_names                  = []
        skip_final_snapshot                   = true
        status                                = "available"
        storage_encrypted                     = false
        storage_type                          = "gp2"
        tags                                  = {}
        username                              = "dashboard_master"
        vpc_security_group_ids                = [
            "sg-0d1c2702a5ed97a2b",
        ]
    }

  # module.wordpress.module.db.module.database.aws_db_instance.default will be updated in-place
  ~ resource "aws_db_instance" "default" {
        address                               = "terraform-20200416212302214500000001.clsowbdquocd.us-east-1.rds.amazonaws.com"
      ~ allocated_storage                     = 10 -> 20
        arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200416212302214500000001"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1b"
        backup_retention_period               = 0
        backup_window                         = "08:37-09:07"
        ca_cert_identifier                    = "rds-ca-2019"
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
        deletion_protection                   = false
        enabled_cloudwatch_logs_exports       = []
        endpoint                              = "terraform-20200416212302214500000001.clsowbdquocd.us-east-1.rds.amazonaws.com:3306"
        engine                                = "mysql"
        engine_version                        = "5.7.22"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "terraform-20200416212302214500000001"
        identifier                            = "terraform-20200416212302214500000001"
        instance_class                        = "db.t2.micro"
        iops                                  = 0
        license_model                         = "general-public-license"
        maintenance_window                    = "wed:05:51-wed:06:21"
        max_allocated_storage                 = 0
        monitoring_interval                   = 0
        multi_az                              = false
        name                                  = "wordpress_db"
        option_group_name                     = "default:mysql-5-7"
        parameter_group_name                  = "default.mysql5.7"
        password                              = (sensitive value)
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 3306
        publicly_accessible                   = false
        replicas                              = []
        resource_id                           = "db-MET3AZVDBB4AOXYELLSGNXWDE4"
        security_group_names                  = []
        skip_final_snapshot                   = true
        status                                = "available"
        storage_encrypted                     = false
        storage_type                          = "gp2"
        tags                                  = {}
        username                              = "wordpress_master"
        vpc_security_group_ids                = [
            "sg-0f20bfde5c89db743",
        ]
    }

Plan: 4 to add, 11 to change, 0 to destroy.

------------------------------------------------------------------------
```